tools/benchmark/results-fetched-50k-1.5kb/results/mongo-sheet-get.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/k6/sheet-get.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * sheet_get: 50 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 344 complete and 0 interrupted iterations
sheet_get   [   0% ] 50 VUs  0m01.0s/5m0s

running (0m02.0s), 50/50 VUs, 720 complete and 0 interrupted iterations
sheet_get   [   1% ] 50 VUs  0m02.0s/5m0s

running (0m03.0s), 50/50 VUs, 1345 complete and 0 interrupted iterations
sheet_get   [   1% ] 50 VUs  0m03.0s/5m0s

running (0m04.0s), 50/50 VUs, 1975 complete and 0 interrupted iterations
sheet_get   [   1% ] 50 VUs  0m04.0s/5m0s

running (0m05.0s), 50/50 VUs, 2724 complete and 0 interrupted iterations
sheet_get   [   2% ] 50 VUs  0m05.0s/5m0s

running (0m06.0s), 50/50 VUs, 3309 complete and 0 interrupted iterations
sheet_get   [   2% ] 50 VUs  0m06.0s/5m0s

running (0m07.0s), 50/50 VUs, 3985 complete and 0 interrupted iterations
sheet_get   [   2% ] 50 VUs  0m07.0s/5m0s

running (0m08.0s), 50/50 VUs, 4600 complete and 0 interrupted iterations
sheet_get   [   3% ] 50 VUs  0m08.0s/5m0s

running (0m09.0s), 50/50 VUs, 5313 complete and 0 interrupted iterations
sheet_get   [   3% ] 50 VUs  0m09.0s/5m0s

running (0m10.0s), 50/50 VUs, 6029 complete and 0 interrupted iterations
sheet_get   [   3% ] 50 VUs  0m10.0s/5m0s

running (0m11.0s), 50/50 VUs, 6816 complete and 0 interrupted iterations
sheet_get   [   4% ] 50 VUs  0m11.0s/5m0s

running (0m12.0s), 50/50 VUs, 7599 complete and 0 interrupted iterations
sheet_get   [   4% ] 50 VUs  0m12.0s/5m0s

running (0m13.0s), 50/50 VUs, 8324 complete and 0 interrupted iterations
sheet_get   [   4% ] 50 VUs  0m13.0s/5m0s

running (0m14.0s), 50/50 VUs, 8890 complete and 0 interrupted iterations
sheet_get   [   5% ] 50 VUs  0m14.0s/5m0s

running (0m15.0s), 50/50 VUs, 9591 complete and 0 interrupted iterations
sheet_get   [   5% ] 50 VUs  0m15.0s/5m0s

running (0m16.0s), 50/50 VUs, 10365 complete and 0 interrupted iterations
sheet_get   [   5% ] 50 VUs  0m16.0s/5m0s

running (0m17.0s), 50/50 VUs, 11127 complete and 0 interrupted iterations
sheet_get   [   6% ] 50 VUs  0m17.0s/5m0s

running (0m18.0s), 50/50 VUs, 11943 complete and 0 interrupted iterations
sheet_get   [   6% ] 50 VUs  0m18.0s/5m0s

running (0m19.0s), 50/50 VUs, 12756 complete and 0 interrupted iterations
sheet_get   [   6% ] 50 VUs  0m19.0s/5m0s

running (0m20.0s), 50/50 VUs, 13419 complete and 0 interrupted iterations
sheet_get   [   7% ] 50 VUs  0m20.0s/5m0s

running (0m21.0s), 50/50 VUs, 14189 complete and 0 interrupted iterations
sheet_get   [   7% ] 50 VUs  0m21.0s/5m0s

running (0m22.0s), 50/50 VUs, 14972 complete and 0 interrupted iterations
sheet_get   [   7% ] 50 VUs  0m22.0s/5m0s

running (0m23.0s), 50/50 VUs, 15752 complete and 0 interrupted iterations
sheet_get   [   8% ] 50 VUs  0m23.0s/5m0s

running (0m24.0s), 50/50 VUs, 16582 complete and 0 interrupted iterations
sheet_get   [   8% ] 50 VUs  0m24.0s/5m0s

running (0m25.0s), 50/50 VUs, 17459 complete and 0 interrupted iterations
sheet_get   [   8% ] 50 VUs  0m25.0s/5m0s

running (0m26.0s), 50/50 VUs, 18189 complete and 0 interrupted iterations
sheet_get   [   9% ] 50 VUs  0m26.0s/5m0s

running (0m27.0s), 50/50 VUs, 18847 complete and 0 interrupted iterations
sheet_get   [   9% ] 50 VUs  0m27.0s/5m0s

running (0m28.0s), 50/50 VUs, 19626 complete and 0 interrupted iterations
sheet_get   [   9% ] 50 VUs  0m28.0s/5m0s

running (0m29.0s), 50/50 VUs, 20447 complete and 0 interrupted iterations
sheet_get   [  10% ] 50 VUs  0m29.0s/5m0s

running (0m30.0s), 50/50 VUs, 21181 complete and 0 interrupted iterations
sheet_get   [  10% ] 50 VUs  0m30.0s/5m0s

running (0m31.0s), 50/50 VUs, 21999 complete and 0 interrupted iterations
sheet_get   [  10% ] 50 VUs  0m31.0s/5m0s

running (0m32.0s), 50/50 VUs, 22826 complete and 0 interrupted iterations
sheet_get   [  11% ] 50 VUs  0m32.0s/5m0s

running (0m33.0s), 50/50 VUs, 23418 complete and 0 interrupted iterations
sheet_get   [  11% ] 50 VUs  0m33.0s/5m0s

running (0m34.0s), 50/50 VUs, 24133 complete and 0 interrupted iterations
sheet_get   [  11% ] 50 VUs  0m34.0s/5m0s

running (0m35.0s), 50/50 VUs, 24990 complete and 0 interrupted iterations
sheet_get   [  12% ] 50 VUs  0m35.0s/5m0s

running (0m36.0s), 50/50 VUs, 25838 complete and 0 interrupted iterations
sheet_get   [  12% ] 50 VUs  0m36.0s/5m0s

running (0m37.0s), 50/50 VUs, 26565 complete and 0 interrupted iterations
sheet_get   [  12% ] 50 VUs  0m37.0s/5m0s

running (0m38.0s), 50/50 VUs, 27368 complete and 0 interrupted iterations
sheet_get   [  13% ] 50 VUs  0m38.0s/5m0s

running (0m39.0s), 50/50 VUs, 28132 complete and 0 interrupted iterations
sheet_get   [  13% ] 50 VUs  0m39.0s/5m0s

running (0m40.0s), 50/50 VUs, 28867 complete and 0 interrupted iterations
sheet_get   [  13% ] 50 VUs  0m40.0s/5m0s

running (0m41.0s), 50/50 VUs, 29714 complete and 0 interrupted iterations
sheet_get   [  14% ] 50 VUs  0m41.0s/5m0s

running (0m42.0s), 50/50 VUs, 30527 complete and 0 interrupted iterations
sheet_get   [  14% ] 50 VUs  0m42.0s/5m0s

running (0m43.0s), 50/50 VUs, 31343 complete and 0 interrupted iterations
sheet_get   [  14% ] 50 VUs  0m43.0s/5m0s

running (0m44.0s), 50/50 VUs, 32142 complete and 0 interrupted iterations
sheet_get   [  15% ] 50 VUs  0m44.0s/5m0s

running (0m45.0s), 50/50 VUs, 32906 complete and 0 interrupted iterations
sheet_get   [  15% ] 50 VUs  0m45.0s/5m0s

running (0m46.0s), 50/50 VUs, 33546 complete and 0 interrupted iterations
sheet_get   [  15% ] 50 VUs  0m46.0s/5m0s

running (0m47.0s), 50/50 VUs, 34271 complete and 0 interrupted iterations
sheet_get   [  16% ] 50 VUs  0m47.0s/5m0s

running (0m48.0s), 50/50 VUs, 35041 complete and 0 interrupted iterations
sheet_get   [  16% ] 50 VUs  0m48.0s/5m0s

running (0m49.0s), 50/50 VUs, 35848 complete and 0 interrupted iterations
sheet_get   [  16% ] 50 VUs  0m49.0s/5m0s

running (0m50.0s), 50/50 VUs, 36618 complete and 0 interrupted iterations
sheet_get   [  17% ] 50 VUs  0m50.0s/5m0s

running (0m51.0s), 50/50 VUs, 37396 complete and 0 interrupted iterations
sheet_get   [  17% ] 50 VUs  0m51.0s/5m0s

running (0m52.0s), 50/50 VUs, 38007 complete and 0 interrupted iterations
sheet_get   [  17% ] 50 VUs  0m52.0s/5m0s

running (0m53.0s), 50/50 VUs, 38832 complete and 0 interrupted iterations
sheet_get   [  18% ] 50 VUs  0m53.0s/5m0s

running (0m54.0s), 50/50 VUs, 39674 complete and 0 interrupted iterations
sheet_get   [  18% ] 50 VUs  0m54.0s/5m0s

running (0m55.0s), 50/50 VUs, 40538 complete and 0 interrupted iterations
sheet_get   [  18% ] 50 VUs  0m55.0s/5m0s

running (0m56.0s), 50/50 VUs, 41390 complete and 0 interrupted iterations
sheet_get   [  19% ] 50 VUs  0m56.0s/5m0s

running (0m57.0s), 50/50 VUs, 42176 complete and 0 interrupted iterations
sheet_get   [  19% ] 50 VUs  0m57.0s/5m0s

running (0m58.0s), 50/50 VUs, 42817 complete and 0 interrupted iterations
sheet_get   [  19% ] 50 VUs  0m58.0s/5m0s

running (0m59.0s), 50/50 VUs, 43633 complete and 0 interrupted iterations
sheet_get   [  20% ] 50 VUs  0m59.0s/5m0s

running (1m00.0s), 50/50 VUs, 44463 complete and 0 interrupted iterations
sheet_get   [  20% ] 50 VUs  1m00.0s/5m0s

running (1m01.0s), 50/50 VUs, 45306 complete and 0 interrupted iterations
sheet_get   [  20% ] 50 VUs  1m01.0s/5m0s

running (1m02.0s), 50/50 VUs, 46165 complete and 0 interrupted iterations
sheet_get   [  21% ] 50 VUs  1m02.0s/5m0s

running (1m03.0s), 50/50 VUs, 46945 complete and 0 interrupted iterations
sheet_get   [  21% ] 50 VUs  1m03.0s/5m0s

running (1m04.0s), 50/50 VUs, 47550 complete and 0 interrupted iterations
sheet_get   [  21% ] 50 VUs  1m04.0s/5m0s

running (1m05.0s), 50/50 VUs, 48293 complete and 0 interrupted iterations
sheet_get   [  22% ] 50 VUs  1m05.0s/5m0s

running (1m06.0s), 50/50 VUs, 49090 complete and 0 interrupted iterations
sheet_get   [  22% ] 50 VUs  1m06.0s/5m0s

running (1m07.0s), 50/50 VUs, 49877 complete and 0 interrupted iterations
sheet_get   [  22% ] 50 VUs  1m07.0s/5m0s

running (1m08.0s), 50/50 VUs, 50692 complete and 0 interrupted iterations
sheet_get   [  23% ] 50 VUs  1m08.0s/5m0s

running (1m09.0s), 50/50 VUs, 51505 complete and 0 interrupted iterations
sheet_get   [  23% ] 50 VUs  1m09.0s/5m0s

running (1m10.0s), 50/50 VUs, 52204 complete and 0 interrupted iterations
sheet_get   [  23% ] 50 VUs  1m10.0s/5m0s

running (1m11.0s), 50/50 VUs, 52930 complete and 0 interrupted iterations
sheet_get   [  24% ] 50 VUs  1m11.0s/5m0s

running (1m12.0s), 50/50 VUs, 53709 complete and 0 interrupted iterations
sheet_get   [  24% ] 50 VUs  1m12.0s/5m0s

running (1m13.0s), 50/50 VUs, 54475 complete and 0 interrupted iterations
sheet_get   [  24% ] 50 VUs  1m13.0s/5m0s

running (1m14.0s), 50/50 VUs, 55133 complete and 0 interrupted iterations
sheet_get   [  25% ] 50 VUs  1m14.0s/5m0s

running (1m15.0s), 50/50 VUs, 55818 complete and 0 interrupted iterations
sheet_get   [  25% ] 50 VUs  1m15.0s/5m0s

running (1m16.0s), 50/50 VUs, 56684 complete and 0 interrupted iterations
sheet_get   [  25% ] 50 VUs  1m16.0s/5m0s

running (1m17.0s), 50/50 VUs, 57202 complete and 0 interrupted iterations
sheet_get   [  26% ] 50 VUs  1m17.0s/5m0s

running (1m18.0s), 50/50 VUs, 57997 complete and 0 interrupted iterations
sheet_get   [  26% ] 50 VUs  1m18.0s/5m0s

running (1m19.0s), 50/50 VUs, 58772 complete and 0 interrupted iterations
sheet_get   [  26% ] 50 VUs  1m19.0s/5m0s

running (1m20.0s), 50/50 VUs, 59569 complete and 0 interrupted iterations
sheet_get   [  27% ] 50 VUs  1m20.0s/5m0s

running (1m21.0s), 50/50 VUs, 60452 complete and 0 interrupted iterations
sheet_get   [  27% ] 50 VUs  1m21.0s/5m0s

running (1m22.0s), 50/50 VUs, 61227 complete and 0 interrupted iterations
sheet_get   [  27% ] 50 VUs  1m22.0s/5m0s

running (1m23.0s), 50/50 VUs, 61971 complete and 0 interrupted iterations
sheet_get   [  28% ] 50 VUs  1m23.0s/5m0s

running (1m24.0s), 50/50 VUs, 62689 complete and 0 interrupted iterations
sheet_get   [  28% ] 50 VUs  1m24.0s/5m0s

running (1m25.0s), 50/50 VUs, 63459 complete and 0 interrupted iterations
sheet_get   [  28% ] 50 VUs  1m25.0s/5m0s

running (1m26.0s), 50/50 VUs, 64289 complete and 0 interrupted iterations
sheet_get   [  29% ] 50 VUs  1m26.0s/5m0s

running (1m27.0s), 50/50 VUs, 65072 complete and 0 interrupted iterations
sheet_get   [  29% ] 50 VUs  1m27.0s/5m0s

running (1m28.0s), 50/50 VUs, 65785 complete and 0 interrupted iterations
sheet_get   [  29% ] 50 VUs  1m28.0s/5m0s

running (1m29.0s), 50/50 VUs, 66522 complete and 0 interrupted iterations
sheet_get   [  30% ] 50 VUs  1m29.0s/5m0s

running (1m30.0s), 50/50 VUs, 67002 complete and 0 interrupted iterations
sheet_get   [  30% ] 50 VUs  1m30.0s/5m0s

running (1m31.0s), 50/50 VUs, 67777 complete and 0 interrupted iterations
sheet_get   [  30% ] 50 VUs  1m31.0s/5m0s

running (1m32.0s), 50/50 VUs, 68543 complete and 0 interrupted iterations
sheet_get   [  31% ] 50 VUs  1m32.0s/5m0s

running (1m33.0s), 50/50 VUs, 69266 complete and 0 interrupted iterations
sheet_get   [  31% ] 50 VUs  1m33.0s/5m0s

running (1m34.0s), 50/50 VUs, 70102 complete and 0 interrupted iterations
sheet_get   [  31% ] 50 VUs  1m34.0s/5m0s

running (1m35.0s), 50/50 VUs, 70869 complete and 0 interrupted iterations
sheet_get   [  32% ] 50 VUs  1m35.0s/5m0s

running (1m36.0s), 50/50 VUs, 71584 complete and 0 interrupted iterations
sheet_get   [  32% ] 50 VUs  1m36.0s/5m0s

running (1m37.0s), 50/50 VUs, 72349 complete and 0 interrupted iterations
sheet_get   [  32% ] 50 VUs  1m37.0s/5m0s

running (1m38.0s), 50/50 VUs, 73087 complete and 0 interrupted iterations
sheet_get   [  33% ] 50 VUs  1m38.0s/5m0s

running (1m39.0s), 50/50 VUs, 73841 complete and 0 interrupted iterations
sheet_get   [  33% ] 50 VUs  1m39.0s/5m0s

running (1m40.0s), 50/50 VUs, 74643 complete and 0 interrupted iterations
sheet_get   [  33% ] 50 VUs  1m40.0s/5m0s

running (1m41.0s), 50/50 VUs, 75490 complete and 0 interrupted iterations
sheet_get   [  34% ] 50 VUs  1m41.0s/5m0s

running (1m42.0s), 50/50 VUs, 76263 complete and 0 interrupted iterations
sheet_get   [  34% ] 50 VUs  1m42.0s/5m0s

running (1m43.0s), 50/50 VUs, 76978 complete and 0 interrupted iterations
sheet_get   [  34% ] 50 VUs  1m43.0s/5m0s

running (1m44.0s), 50/50 VUs, 77774 complete and 0 interrupted iterations
sheet_get   [  35% ] 50 VUs  1m44.0s/5m0s

running (1m45.0s), 50/50 VUs, 78523 complete and 0 interrupted iterations
sheet_get   [  35% ] 50 VUs  1m45.0s/5m0s

running (1m46.0s), 50/50 VUs, 79346 complete and 0 interrupted iterations
sheet_get   [  35% ] 50 VUs  1m46.0s/5m0s

running (1m47.0s), 50/50 VUs, 80140 complete and 0 interrupted iterations
sheet_get   [  36% ] 50 VUs  1m47.0s/5m0s

running (1m48.0s), 50/50 VUs, 80847 complete and 0 interrupted iterations
sheet_get   [  36% ] 50 VUs  1m48.0s/5m0s

running (1m49.0s), 50/50 VUs, 81538 complete and 0 interrupted iterations
sheet_get   [  36% ] 50 VUs  1m49.0s/5m0s

running (1m50.0s), 50/50 VUs, 82303 complete and 0 interrupted iterations
sheet_get   [  37% ] 50 VUs  1m50.0s/5m0s

running (1m51.0s), 50/50 VUs, 83125 complete and 0 interrupted iterations
sheet_get   [  37% ] 50 VUs  1m51.0s/5m0s

running (1m52.0s), 50/50 VUs, 83889 complete and 0 interrupted iterations
sheet_get   [  37% ] 50 VUs  1m52.0s/5m0s

running (1m53.0s), 50/50 VUs, 84712 complete and 0 interrupted iterations
sheet_get   [  38% ] 50 VUs  1m53.0s/5m0s

running (1m54.0s), 50/50 VUs, 85542 complete and 0 interrupted iterations
sheet_get   [  38% ] 50 VUs  1m54.0s/5m0s

running (1m55.0s), 50/50 VUs, 86148 complete and 0 interrupted iterations
sheet_get   [  38% ] 50 VUs  1m55.0s/5m0s

running (1m56.0s), 50/50 VUs, 86958 complete and 0 interrupted iterations
sheet_get   [  39% ] 50 VUs  1m56.0s/5m0s

running (1m57.0s), 50/50 VUs, 87651 complete and 0 interrupted iterations
sheet_get   [  39% ] 50 VUs  1m57.0s/5m0s

running (1m58.0s), 50/50 VUs, 88487 complete and 0 interrupted iterations
sheet_get   [  39% ] 50 VUs  1m58.0s/5m0s

running (1m59.0s), 50/50 VUs, 89260 complete and 0 interrupted iterations
sheet_get   [  40% ] 50 VUs  1m59.0s/5m0s

running (2m00.0s), 50/50 VUs, 90058 complete and 0 interrupted iterations
sheet_get   [  40% ] 50 VUs  2m00.0s/5m0s

running (2m01.0s), 50/50 VUs, 90725 complete and 0 interrupted iterations
sheet_get   [  40% ] 50 VUs  2m01.0s/5m0s

running (2m02.0s), 50/50 VUs, 91548 complete and 0 interrupted iterations
sheet_get   [  41% ] 50 VUs  2m02.0s/5m0s

running (2m03.0s), 50/50 VUs, 92404 complete and 0 interrupted iterations
sheet_get   [  41% ] 50 VUs  2m03.0s/5m0s

running (2m04.0s), 50/50 VUs, 93196 complete and 0 interrupted iterations
sheet_get   [  41% ] 50 VUs  2m04.0s/5m0s

running (2m05.0s), 50/50 VUs, 94019 complete and 0 interrupted iterations
sheet_get   [  42% ] 50 VUs  2m05.0s/5m0s

running (2m06.0s), 50/50 VUs, 94834 complete and 0 interrupted iterations
sheet_get   [  42% ] 50 VUs  2m06.0s/5m0s

running (2m07.0s), 50/50 VUs, 95436 complete and 0 interrupted iterations
sheet_get   [  42% ] 50 VUs  2m07.0s/5m0s

running (2m08.0s), 50/50 VUs, 96219 complete and 0 interrupted iterations
sheet_get   [  43% ] 50 VUs  2m08.0s/5m0s

running (2m09.0s), 50/50 VUs, 97028 complete and 0 interrupted iterations
sheet_get   [  43% ] 50 VUs  2m09.0s/5m0s

running (2m10.0s), 50/50 VUs, 97787 complete and 0 interrupted iterations
sheet_get   [  43% ] 50 VUs  2m10.0s/5m0s

running (2m11.0s), 50/50 VUs, 98579 complete and 0 interrupted iterations
sheet_get   [  44% ] 50 VUs  2m11.0s/5m0s

running (2m12.0s), 50/50 VUs, 99358 complete and 0 interrupted iterations
sheet_get   [  44% ] 50 VUs  2m12.0s/5m0s

running (2m13.0s), 50/50 VUs, 100039 complete and 0 interrupted iterations
sheet_get   [  44% ] 50 VUs  2m13.0s/5m0s

running (2m14.0s), 50/50 VUs, 100803 complete and 0 interrupted iterations
sheet_get   [  45% ] 50 VUs  2m14.0s/5m0s

running (2m15.0s), 50/50 VUs, 101359 complete and 0 interrupted iterations
sheet_get   [  45% ] 50 VUs  2m15.0s/5m0s

running (2m16.0s), 50/50 VUs, 102122 complete and 0 interrupted iterations
sheet_get   [  45% ] 50 VUs  2m16.0s/5m0s

running (2m17.0s), 50/50 VUs, 102877 complete and 0 interrupted iterations
sheet_get   [  46% ] 50 VUs  2m17.0s/5m0s

running (2m18.0s), 50/50 VUs, 103632 complete and 0 interrupted iterations
sheet_get   [  46% ] 50 VUs  2m18.0s/5m0s

running (2m19.0s), 50/50 VUs, 104340 complete and 0 interrupted iterations
sheet_get   [  46% ] 50 VUs  2m19.0s/5m0s

running (2m20.0s), 50/50 VUs, 104963 complete and 0 interrupted iterations
sheet_get   [  47% ] 50 VUs  2m20.0s/5m0s

running (2m21.0s), 50/50 VUs, 105737 complete and 0 interrupted iterations
sheet_get   [  47% ] 50 VUs  2m21.0s/5m0s

running (2m22.0s), 50/50 VUs, 106578 complete and 0 interrupted iterations
sheet_get   [  47% ] 50 VUs  2m22.0s/5m0s

running (2m23.0s), 50/50 VUs, 107343 complete and 0 interrupted iterations
sheet_get   [  48% ] 50 VUs  2m23.0s/5m0s

running (2m24.0s), 50/50 VUs, 108131 complete and 0 interrupted iterations
sheet_get   [  48% ] 50 VUs  2m24.0s/5m0s

running (2m25.0s), 50/50 VUs, 108866 complete and 0 interrupted iterations
sheet_get   [  48% ] 50 VUs  2m25.0s/5m0s

running (2m26.0s), 50/50 VUs, 109498 complete and 0 interrupted iterations
sheet_get   [  49% ] 50 VUs  2m26.0s/5m0s

running (2m27.0s), 50/50 VUs, 110216 complete and 0 interrupted iterations
sheet_get   [  49% ] 50 VUs  2m27.0s/5m0s

running (2m28.0s), 50/50 VUs, 111005 complete and 0 interrupted iterations
sheet_get   [  49% ] 50 VUs  2m28.0s/5m0s

running (2m29.0s), 50/50 VUs, 111781 complete and 0 interrupted iterations
sheet_get   [  50% ] 50 VUs  2m29.0s/5m0s

running (2m30.0s), 50/50 VUs, 112499 complete and 0 interrupted iterations
sheet_get   [  50% ] 50 VUs  2m30.0s/5m0s

running (2m31.0s), 50/50 VUs, 113262 complete and 0 interrupted iterations
sheet_get   [  50% ] 50 VUs  2m31.0s/5m0s

running (2m32.0s), 50/50 VUs, 113867 complete and 0 interrupted iterations
sheet_get   [  51% ] 50 VUs  2m32.0s/5m0s

running (2m33.0s), 50/50 VUs, 114651 complete and 0 interrupted iterations
sheet_get   [  51% ] 50 VUs  2m33.0s/5m0s

running (2m34.0s), 50/50 VUs, 115433 complete and 0 interrupted iterations
sheet_get   [  51% ] 50 VUs  2m34.0s/5m0s

running (2m35.0s), 50/50 VUs, 116276 complete and 0 interrupted iterations
sheet_get   [  52% ] 50 VUs  2m35.0s/5m0s

running (2m36.0s), 50/50 VUs, 117030 complete and 0 interrupted iterations
sheet_get   [  52% ] 50 VUs  2m36.0s/5m0s

running (2m37.0s), 50/50 VUs, 117826 complete and 0 interrupted iterations
sheet_get   [  52% ] 50 VUs  2m37.0s/5m0s

running (2m38.0s), 50/50 VUs, 118494 complete and 0 interrupted iterations
sheet_get   [  53% ] 50 VUs  2m38.0s/5m0s

running (2m39.0s), 50/50 VUs, 119286 complete and 0 interrupted iterations
sheet_get   [  53% ] 50 VUs  2m39.0s/5m0s

running (2m40.0s), 50/50 VUs, 120094 complete and 0 interrupted iterations
sheet_get   [  53% ] 50 VUs  2m40.0s/5m0s

running (2m41.0s), 50/50 VUs, 120855 complete and 0 interrupted iterations
sheet_get   [  54% ] 50 VUs  2m41.0s/5m0s

running (2m42.0s), 50/50 VUs, 121675 complete and 0 interrupted iterations
sheet_get   [  54% ] 50 VUs  2m42.0s/5m0s

running (2m43.0s), 50/50 VUs, 122422 complete and 0 interrupted iterations
sheet_get   [  54% ] 50 VUs  2m43.0s/5m0s

running (2m44.0s), 50/50 VUs, 123155 complete and 0 interrupted iterations
sheet_get   [  55% ] 50 VUs  2m44.0s/5m0s

running (2m45.0s), 50/50 VUs, 123812 complete and 0 interrupted iterations
sheet_get   [  55% ] 50 VUs  2m45.0s/5m0s

running (2m46.0s), 50/50 VUs, 124626 complete and 0 interrupted iterations
sheet_get   [  55% ] 50 VUs  2m46.0s/5m0s

running (2m47.0s), 50/50 VUs, 125399 complete and 0 interrupted iterations
sheet_get   [  56% ] 50 VUs  2m47.0s/5m0s

running (2m48.0s), 50/50 VUs, 126209 complete and 0 interrupted iterations
sheet_get   [  56% ] 50 VUs  2m48.0s/5m0s

running (2m49.0s), 50/50 VUs, 126973 complete and 0 interrupted iterations
sheet_get   [  56% ] 50 VUs  2m49.0s/5m0s

running (2m50.0s), 50/50 VUs, 127692 complete and 0 interrupted iterations
sheet_get   [  57% ] 50 VUs  2m50.0s/5m0s

running (2m51.0s), 50/50 VUs, 128421 complete and 0 interrupted iterations
sheet_get   [  57% ] 50 VUs  2m51.0s/5m0s

running (2m52.0s), 50/50 VUs, 129220 complete and 0 interrupted iterations
sheet_get   [  57% ] 50 VUs  2m52.0s/5m0s

running (2m53.0s), 50/50 VUs, 130001 complete and 0 interrupted iterations
sheet_get   [  58% ] 50 VUs  2m53.0s/5m0s

running (2m54.0s), 50/50 VUs, 130824 complete and 0 interrupted iterations
sheet_get   [  58% ] 50 VUs  2m54.0s/5m0s

running (2m55.0s), 50/50 VUs, 131657 complete and 0 interrupted iterations
sheet_get   [  58% ] 50 VUs  2m55.0s/5m0s

running (2m56.0s), 50/50 VUs, 132408 complete and 0 interrupted iterations
sheet_get   [  59% ] 50 VUs  2m56.0s/5m0s

running (2m57.0s), 50/50 VUs, 133074 complete and 0 interrupted iterations
sheet_get   [  59% ] 50 VUs  2m57.0s/5m0s

running (2m58.0s), 50/50 VUs, 133859 complete and 0 interrupted iterations
sheet_get   [  59% ] 50 VUs  2m58.0s/5m0s

running (2m59.0s), 50/50 VUs, 134671 complete and 0 interrupted iterations
sheet_get   [  60% ] 50 VUs  2m59.0s/5m0s

running (3m00.0s), 50/50 VUs, 135447 complete and 0 interrupted iterations
sheet_get   [  60% ] 50 VUs  3m00.0s/5m0s

running (3m01.0s), 50/50 VUs, 136248 complete and 0 interrupted iterations
sheet_get   [  60% ] 50 VUs  3m01.0s/5m0s

running (3m02.0s), 50/50 VUs, 136991 complete and 0 interrupted iterations
sheet_get   [  61% ] 50 VUs  3m02.0s/5m0s

running (3m03.0s), 50/50 VUs, 137616 complete and 0 interrupted iterations
sheet_get   [  61% ] 50 VUs  3m03.0s/5m0s

running (3m04.0s), 50/50 VUs, 138425 complete and 0 interrupted iterations
sheet_get   [  61% ] 50 VUs  3m04.0s/5m0s

running (3m05.0s), 50/50 VUs, 139272 complete and 0 interrupted iterations
sheet_get   [  62% ] 50 VUs  3m05.0s/5m0s

running (3m06.0s), 50/50 VUs, 140101 complete and 0 interrupted iterations
sheet_get   [  62% ] 50 VUs  3m06.0s/5m0s

running (3m07.0s), 50/50 VUs, 140934 complete and 0 interrupted iterations
sheet_get   [  62% ] 50 VUs  3m07.0s/5m0s

running (3m08.0s), 50/50 VUs, 141694 complete and 0 interrupted iterations
sheet_get   [  63% ] 50 VUs  3m08.0s/5m0s

running (3m09.0s), 50/50 VUs, 142474 complete and 0 interrupted iterations
sheet_get   [  63% ] 50 VUs  3m09.0s/5m0s

running (3m10.0s), 50/50 VUs, 143186 complete and 0 interrupted iterations
sheet_get   [  63% ] 50 VUs  3m10.0s/5m0s

running (3m11.0s), 50/50 VUs, 143995 complete and 0 interrupted iterations
sheet_get   [  64% ] 50 VUs  3m11.0s/5m0s

running (3m12.0s), 50/50 VUs, 144828 complete and 0 interrupted iterations
sheet_get   [  64% ] 50 VUs  3m12.0s/5m0s

running (3m13.0s), 50/50 VUs, 145564 complete and 0 interrupted iterations
sheet_get   [  64% ] 50 VUs  3m13.0s/5m0s

running (3m14.0s), 50/50 VUs, 146389 complete and 0 interrupted iterations
sheet_get   [  65% ] 50 VUs  3m14.0s/5m0s

running (3m15.0s), 50/50 VUs, 146986 complete and 0 interrupted iterations
sheet_get   [  65% ] 50 VUs  3m15.0s/5m0s

running (3m16.0s), 50/50 VUs, 147477 complete and 0 interrupted iterations
sheet_get   [  65% ] 50 VUs  3m16.0s/5m0s

running (3m17.0s), 50/50 VUs, 148277 complete and 0 interrupted iterations
sheet_get   [  66% ] 50 VUs  3m17.0s/5m0s

running (3m18.0s), 50/50 VUs, 149018 complete and 0 interrupted iterations
sheet_get   [  66% ] 50 VUs  3m18.0s/5m0s

running (3m19.0s), 50/50 VUs, 149757 complete and 0 interrupted iterations
sheet_get   [  66% ] 50 VUs  3m19.0s/5m0s

running (3m20.0s), 50/50 VUs, 150543 complete and 0 interrupted iterations
sheet_get   [  67% ] 50 VUs  3m20.0s/5m0s

running (3m21.0s), 50/50 VUs, 151312 complete and 0 interrupted iterations
sheet_get   [  67% ] 50 VUs  3m21.0s/5m0s

running (3m22.0s), 50/50 VUs, 152012 complete and 0 interrupted iterations
sheet_get   [  67% ] 50 VUs  3m22.0s/5m0s

running (3m23.0s), 50/50 VUs, 152668 complete and 0 interrupted iterations
sheet_get   [  68% ] 50 VUs  3m23.0s/5m0s

running (3m24.0s), 50/50 VUs, 153462 complete and 0 interrupted iterations
sheet_get   [  68% ] 50 VUs  3m24.0s/5m0s

running (3m25.0s), 50/50 VUs, 154240 complete and 0 interrupted iterations
sheet_get   [  68% ] 50 VUs  3m25.0s/5m0s

running (3m26.0s), 50/50 VUs, 154994 complete and 0 interrupted iterations
sheet_get   [  69% ] 50 VUs  3m26.0s/5m0s

running (3m27.0s), 50/50 VUs, 155861 complete and 0 interrupted iterations
sheet_get   [  69% ] 50 VUs  3m27.0s/5m0s

running (3m28.0s), 50/50 VUs, 156568 complete and 0 interrupted iterations
sheet_get   [  69% ] 50 VUs  3m28.0s/5m0s

running (3m29.0s), 50/50 VUs, 157234 complete and 0 interrupted iterations
sheet_get   [  70% ] 50 VUs  3m29.0s/5m0s

running (3m30.0s), 50/50 VUs, 158050 complete and 0 interrupted iterations
sheet_get   [  70% ] 50 VUs  3m30.0s/5m0s

running (3m31.0s), 50/50 VUs, 158800 complete and 0 interrupted iterations
sheet_get   [  70% ] 50 VUs  3m31.0s/5m0s

running (3m32.0s), 50/50 VUs, 159634 complete and 0 interrupted iterations
sheet_get   [  71% ] 50 VUs  3m32.0s/5m0s

running (3m33.0s), 50/50 VUs, 160440 complete and 0 interrupted iterations
sheet_get   [  71% ] 50 VUs  3m33.0s/5m0s

running (3m34.0s), 50/50 VUs, 161260 complete and 0 interrupted iterations
sheet_get   [  71% ] 50 VUs  3m34.0s/5m0s

running (3m35.0s), 50/50 VUs, 161889 complete and 0 interrupted iterations
sheet_get   [  72% ] 50 VUs  3m35.0s/5m0s

running (3m36.0s), 50/50 VUs, 162697 complete and 0 interrupted iterations
sheet_get   [  72% ] 50 VUs  3m36.0s/5m0s

running (3m37.0s), 50/50 VUs, 163556 complete and 0 interrupted iterations
sheet_get   [  72% ] 50 VUs  3m37.0s/5m0s

running (3m38.0s), 50/50 VUs, 164351 complete and 0 interrupted iterations
sheet_get   [  73% ] 50 VUs  3m38.0s/5m0s

running (3m39.0s), 50/50 VUs, 165104 complete and 0 interrupted iterations
sheet_get   [  73% ] 50 VUs  3m39.0s/5m0s

running (3m40.0s), 50/50 VUs, 165897 complete and 0 interrupted iterations
sheet_get   [  73% ] 50 VUs  3m40.0s/5m0s

running (3m41.0s), 50/50 VUs, 166510 complete and 0 interrupted iterations
sheet_get   [  74% ] 50 VUs  3m41.0s/5m0s

running (3m42.0s), 50/50 VUs, 167305 complete and 0 interrupted iterations
sheet_get   [  74% ] 50 VUs  3m42.0s/5m0s

running (3m43.0s), 50/50 VUs, 168141 complete and 0 interrupted iterations
sheet_get   [  74% ] 50 VUs  3m43.0s/5m0s

running (3m44.0s), 50/50 VUs, 168894 complete and 0 interrupted iterations
sheet_get   [  75% ] 50 VUs  3m44.0s/5m0s

running (3m45.0s), 50/50 VUs, 169606 complete and 0 interrupted iterations
sheet_get   [  75% ] 50 VUs  3m45.0s/5m0s

running (3m46.0s), 50/50 VUs, 170403 complete and 0 interrupted iterations
sheet_get   [  75% ] 50 VUs  3m46.0s/5m0s

running (3m47.0s), 50/50 VUs, 171057 complete and 0 interrupted iterations
sheet_get   [  76% ] 50 VUs  3m47.0s/5m0s

running (3m48.0s), 50/50 VUs, 171740 complete and 0 interrupted iterations
sheet_get   [  76% ] 50 VUs  3m48.0s/5m0s

running (3m49.0s), 50/50 VUs, 172481 complete and 0 interrupted iterations
sheet_get   [  76% ] 50 VUs  3m49.0s/5m0s

running (3m50.0s), 50/50 VUs, 173282 complete and 0 interrupted iterations
sheet_get   [  77% ] 50 VUs  3m50.0s/5m0s

running (3m51.0s), 50/50 VUs, 174079 complete and 0 interrupted iterations
sheet_get   [  77% ] 50 VUs  3m51.0s/5m0s

running (3m52.0s), 50/50 VUs, 174844 complete and 0 interrupted iterations
sheet_get   [  77% ] 50 VUs  3m52.0s/5m0s

running (3m53.0s), 50/50 VUs, 175503 complete and 0 interrupted iterations
sheet_get   [  78% ] 50 VUs  3m53.0s/5m0s

running (3m54.0s), 50/50 VUs, 176267 complete and 0 interrupted iterations
sheet_get   [  78% ] 50 VUs  3m54.0s/5m0s

running (3m55.0s), 50/50 VUs, 177098 complete and 0 interrupted iterations
sheet_get   [  78% ] 50 VUs  3m55.0s/5m0s

running (3m56.0s), 50/50 VUs, 177927 complete and 0 interrupted iterations
sheet_get   [  79% ] 50 VUs  3m56.0s/5m0s

running (3m57.0s), 50/50 VUs, 178769 complete and 0 interrupted iterations
sheet_get   [  79% ] 50 VUs  3m57.0s/5m0s

running (3m58.0s), 50/50 VUs, 179551 complete and 0 interrupted iterations
sheet_get   [  79% ] 50 VUs  3m58.0s/5m0s

running (3m59.0s), 50/50 VUs, 180321 complete and 0 interrupted iterations
sheet_get   [  80% ] 50 VUs  3m59.0s/5m0s

running (4m00.0s), 50/50 VUs, 180971 complete and 0 interrupted iterations
sheet_get   [  80% ] 50 VUs  4m00.0s/5m0s

running (4m01.0s), 50/50 VUs, 181805 complete and 0 interrupted iterations
sheet_get   [  80% ] 50 VUs  4m01.0s/5m0s

running (4m02.0s), 50/50 VUs, 182603 complete and 0 interrupted iterations
sheet_get   [  81% ] 50 VUs  4m02.0s/5m0s

running (4m03.0s), 50/50 VUs, 183455 complete and 0 interrupted iterations
sheet_get   [  81% ] 50 VUs  4m03.0s/5m0s

running (4m04.0s), 50/50 VUs, 184296 complete and 0 interrupted iterations
sheet_get   [  81% ] 50 VUs  4m04.0s/5m0s

running (4m05.0s), 50/50 VUs, 185113 complete and 0 interrupted iterations
sheet_get   [  82% ] 50 VUs  4m05.0s/5m0s

running (4m06.0s), 50/50 VUs, 185807 complete and 0 interrupted iterations
sheet_get   [  82% ] 50 VUs  4m06.0s/5m0s

running (4m07.0s), 50/50 VUs, 186635 complete and 0 interrupted iterations
sheet_get   [  82% ] 50 VUs  4m07.0s/5m0s

running (4m08.0s), 50/50 VUs, 187523 complete and 0 interrupted iterations
sheet_get   [  83% ] 50 VUs  4m08.0s/5m0s

running (4m09.0s), 50/50 VUs, 188366 complete and 0 interrupted iterations
sheet_get   [  83% ] 50 VUs  4m09.0s/5m0s

running (4m10.0s), 50/50 VUs, 189231 complete and 0 interrupted iterations
sheet_get   [  83% ] 50 VUs  4m10.0s/5m0s

running (4m11.0s), 50/50 VUs, 189990 complete and 0 interrupted iterations
sheet_get   [  84% ] 50 VUs  4m11.0s/5m0s

running (4m12.0s), 50/50 VUs, 190679 complete and 0 interrupted iterations
sheet_get   [  84% ] 50 VUs  4m12.0s/5m0s

running (4m13.0s), 50/50 VUs, 191476 complete and 0 interrupted iterations
sheet_get   [  84% ] 50 VUs  4m13.0s/5m0s

running (4m14.0s), 50/50 VUs, 192313 complete and 0 interrupted iterations
sheet_get   [  85% ] 50 VUs  4m14.0s/5m0s

running (4m15.0s), 50/50 VUs, 193112 complete and 0 interrupted iterations
sheet_get   [  85% ] 50 VUs  4m15.0s/5m0s

running (4m16.0s), 50/50 VUs, 193874 complete and 0 interrupted iterations
sheet_get   [  85% ] 50 VUs  4m16.0s/5m0s

running (4m17.0s), 50/50 VUs, 194599 complete and 0 interrupted iterations
sheet_get   [  86% ] 50 VUs  4m17.0s/5m0s

running (4m18.0s), 50/50 VUs, 195256 complete and 0 interrupted iterations
sheet_get   [  86% ] 50 VUs  4m18.0s/5m0s

running (4m19.0s), 50/50 VUs, 195990 complete and 0 interrupted iterations
sheet_get   [  86% ] 50 VUs  4m19.0s/5m0s

running (4m20.0s), 50/50 VUs, 196719 complete and 0 interrupted iterations
sheet_get   [  87% ] 50 VUs  4m20.0s/5m0s

running (4m21.0s), 50/50 VUs, 197549 complete and 0 interrupted iterations
sheet_get   [  87% ] 50 VUs  4m21.0s/5m0s

running (4m22.0s), 50/50 VUs, 198395 complete and 0 interrupted iterations
sheet_get   [  87% ] 50 VUs  4m22.0s/5m0s

running (4m23.0s), 50/50 VUs, 199116 complete and 0 interrupted iterations
sheet_get   [  88% ] 50 VUs  4m23.0s/5m0s

running (4m24.0s), 50/50 VUs, 199810 complete and 0 interrupted iterations
sheet_get   [  88% ] 50 VUs  4m24.0s/5m0s

running (4m25.0s), 50/50 VUs, 200627 complete and 0 interrupted iterations
sheet_get   [  88% ] 50 VUs  4m25.0s/5m0s

running (4m26.0s), 50/50 VUs, 201357 complete and 0 interrupted iterations
sheet_get   [  89% ] 50 VUs  4m26.0s/5m0s

running (4m27.0s), 50/50 VUs, 202120 complete and 0 interrupted iterations
sheet_get   [  89% ] 50 VUs  4m27.0s/5m0s

running (4m28.0s), 50/50 VUs, 202950 complete and 0 interrupted iterations
sheet_get   [  89% ] 50 VUs  4m28.0s/5m0s

running (4m29.0s), 50/50 VUs, 203755 complete and 0 interrupted iterations
sheet_get   [  90% ] 50 VUs  4m29.0s/5m0s

running (4m30.0s), 50/50 VUs, 204397 complete and 0 interrupted iterations
sheet_get   [  90% ] 50 VUs  4m30.0s/5m0s

running (4m31.0s), 50/50 VUs, 205186 complete and 0 interrupted iterations
sheet_get   [  90% ] 50 VUs  4m31.0s/5m0s

running (4m32.0s), 50/50 VUs, 205991 complete and 0 interrupted iterations
sheet_get   [  91% ] 50 VUs  4m32.0s/5m0s

running (4m33.0s), 50/50 VUs, 206842 complete and 0 interrupted iterations
sheet_get   [  91% ] 50 VUs  4m33.0s/5m0s

running (4m34.0s), 50/50 VUs, 207682 complete and 0 interrupted iterations
sheet_get   [  91% ] 50 VUs  4m34.0s/5m0s

running (4m35.0s), 50/50 VUs, 208517 complete and 0 interrupted iterations
sheet_get   [  92% ] 50 VUs  4m35.0s/5m0s

running (4m36.0s), 50/50 VUs, 209308 complete and 0 interrupted iterations
sheet_get   [  92% ] 50 VUs  4m36.0s/5m0s

running (4m37.0s), 50/50 VUs, 209949 complete and 0 interrupted iterations
sheet_get   [  92% ] 50 VUs  4m37.0s/5m0s

running (4m38.0s), 50/50 VUs, 210825 complete and 0 interrupted iterations
sheet_get   [  93% ] 50 VUs  4m38.0s/5m0s

running (4m39.0s), 50/50 VUs, 211665 complete and 0 interrupted iterations
sheet_get   [  93% ] 50 VUs  4m39.0s/5m0s

running (4m40.0s), 50/50 VUs, 212425 complete and 0 interrupted iterations
sheet_get   [  93% ] 50 VUs  4m40.0s/5m0s

running (4m41.0s), 50/50 VUs, 213265 complete and 0 interrupted iterations
sheet_get   [  94% ] 50 VUs  4m41.0s/5m0s

running (4m42.0s), 50/50 VUs, 214007 complete and 0 interrupted iterations
sheet_get   [  94% ] 50 VUs  4m42.0s/5m0s

running (4m43.0s), 50/50 VUs, 214675 complete and 0 interrupted iterations
sheet_get   [  94% ] 50 VUs  4m43.0s/5m0s

running (4m44.0s), 50/50 VUs, 215470 complete and 0 interrupted iterations
sheet_get   [  95% ] 50 VUs  4m44.0s/5m0s

running (4m45.0s), 50/50 VUs, 216277 complete and 0 interrupted iterations
sheet_get   [  95% ] 50 VUs  4m45.0s/5m0s

running (4m46.0s), 50/50 VUs, 217051 complete and 0 interrupted iterations
sheet_get   [  95% ] 50 VUs  4m46.0s/5m0s

running (4m47.0s), 50/50 VUs, 217849 complete and 0 interrupted iterations
sheet_get   [  96% ] 50 VUs  4m47.0s/5m0s

running (4m48.0s), 50/50 VUs, 218609 complete and 0 interrupted iterations
sheet_get   [  96% ] 50 VUs  4m48.0s/5m0s

running (4m49.0s), 50/50 VUs, 219109 complete and 0 interrupted iterations
sheet_get   [  96% ] 50 VUs  4m49.0s/5m0s

running (4m50.0s), 50/50 VUs, 219884 complete and 0 interrupted iterations
sheet_get   [  97% ] 50 VUs  4m50.0s/5m0s

running (4m51.0s), 50/50 VUs, 220719 complete and 0 interrupted iterations
sheet_get   [  97% ] 50 VUs  4m51.0s/5m0s

running (4m52.0s), 50/50 VUs, 221545 complete and 0 interrupted iterations
sheet_get   [  97% ] 50 VUs  4m52.0s/5m0s

running (4m53.0s), 50/50 VUs, 222339 complete and 0 interrupted iterations
sheet_get   [  98% ] 50 VUs  4m53.0s/5m0s

running (4m54.0s), 50/50 VUs, 223130 complete and 0 interrupted iterations
sheet_get   [  98% ] 50 VUs  4m54.0s/5m0s

running (4m55.0s), 50/50 VUs, 223825 complete and 0 interrupted iterations
sheet_get   [  98% ] 50 VUs  4m55.0s/5m0s

running (4m56.0s), 50/50 VUs, 224608 complete and 0 interrupted iterations
sheet_get   [  99% ] 50 VUs  4m56.0s/5m0s

running (4m57.0s), 50/50 VUs, 225432 complete and 0 interrupted iterations
sheet_get   [  99% ] 50 VUs  4m57.0s/5m0s

running (4m58.0s), 50/50 VUs, 226260 complete and 0 interrupted iterations
sheet_get   [  99% ] 50 VUs  4m58.0s/5m0s

running (4m59.0s), 50/50 VUs, 227026 complete and 0 interrupted iterations
sheet_get   [ 100% ] 50 VUs  4m59.0s/5m0s

running (5m00.0s), 50/50 VUs, 227846 complete and 0 interrupted iterations
sheet_get   [ 100% ] 50 VUs  5m00.0s/5m0s
      ✓ status 200
      ✓ has body

      checks.........................: 100.00% ✓ 455820     ✗ 0     
      data_received..................: 549 MB  1.8 MB/s
      data_sent......................: 26 MB   88 kB/s
      http_req_blocked...............: min=1.92µs   avg=8.68µs  med=4.12µs  p(90)=5.36µs   p(95)=6.36µs   p(99)=31.87µs  max=25.1ms  
      http_req_connecting............: min=0s       avg=1.67µs  med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=8.95ms  
      http_req_duration..............: min=973.52µs avg=14.64ms med=9.07ms  p(90)=34.09ms  p(95)=44.87ms  p(99)=72.15ms  max=295.09ms
        { expected_response:true }...: min=973.52µs avg=14.64ms med=9.07ms  p(90)=34.09ms  p(95)=44.87ms  p(99)=72.15ms  max=295.09ms
      http_req_failed................: 0.00%   ✓ 0          ✗ 227910
      http_req_receiving.............: min=14.23µs  avg=80.26µs med=39.36µs p(90)=183.04µs p(95)=213.32µs p(99)=409.91µs max=66.24ms 
      http_req_sending...............: min=5.32µs   avg=40.86µs med=11.52µs p(90)=23.6µs   p(95)=102.96µs p(99)=458.43µs max=66.33ms 
      http_req_tls_handshaking.......: min=0s       avg=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
      http_req_waiting...............: min=899.04µs avg=14.51ms med=8.96ms  p(90)=33.96ms  p(95)=44.68ms  p(99)=71.96ms  max=293.39ms
      http_reqs......................: 227910  759.554362/s
      iteration_duration.............: min=51.2ms   avg=65.79ms med=60.17ms p(90)=85.74ms  p(95)=96.9ms   p(99)=124.47ms max=356.87ms
      iterations.....................: 227910  759.554362/s
    ✓ sheet_get_errors...............: 0.00%   ✓ 0          ✗ 227910
    ✓ sheet_get_latency_ms...........: min=1ms      avg=14.72ms med=9ms     p(90)=34ms     p(95)=45ms     p(99)=72ms     max=305ms   
      vus............................: 50      min=50       max=50  
      vus_max........................: 50      min=50       max=50  
running (5m00.1s), 00/50 VUs, 227910 complete and 0 interrupted iterations
sheet_get ✓ [ 100% ] 50 VUs  5m0s